package com.example.androidpractice

import androidx.compose.runtime.Composable

@Composable
fun Task14() {
    // TODO: Сделай Row, в котором три круга разного цвета (50.dp) не касаются друг друга.
    //чтоб сделать круг можно использовать Box, Row или Column. и у него .clip(CircleShape)
}

@Composable
fun Task15() {
    // TODO: Размести в Row две кнопки. когда нажали первую она становится некликабельной,
    // TODO: а кликабельной становится вторая, и наоборот когда нажали вторую она блокируется а доступна первая
    // TODO: чтобы тестировать используй интерактивный режим в Превью.
}

@Composable
fun Task16() {
    // TODO: Сделай бургер используя много Роу и Колумн. разукрась его и пусть он занимает весь экран но с отступами от краев экрана
}

@Composable
fun Task17() {
    // TODO: Сделай Row как будто это верхняя панель в приложении. слева идет стрелочка назад, по центру Текстовое название экрана, справа галочка или плюсик.
    // TODO: чтоб это сделать надо сделать роу у которого есть отступы по горвнутри
}

@Composable
fun Task18() {
    // TODO: Создай Row, который содержит два элемента: текст и поле для ввода.
}

@Composable
fun Task19() {
    // TODO: Сделай Row, который имитирует карточку профиля. В нём должно быть:
    // - Картинка (аватар) слева,
    // - Имя и описание по центру,
    // - Кнопка "добавить в друзья" справа.
}

@Composable
fun Task20() {
    // TODO: Создай Row с горизонтальной прокруткой, внутри которой 10 цветных квадратов по 80.dp.
}

@Composable
fun Task21() {
    // TODO: Размести 3 кнопки в Row, ту на которую нажали становится больше, остальные меньше)
}